# B. Мамины поручения

Мама отправила Васю купить продукты в супермаркете и забрать посылку из пункта выдачи

Дорога от дома до супермаркета имеет длину aa метров, от дома до пункта выдачи — b метров, а дорога от супермаркета до пункта выдачи — c метров. Вася может ходить по этим дорогам в любом направлении.

Скорость Васи зависит от того, несет ли он что-нибудь или идёт без груза. Если он не несет ни продукты, ни посылку, то его скорость равна v0​ метров в минуту. Если он несет что-то одно, то его скорость равна v1 метров в минуту (v1≤v0). Если он несет и продукты, и посылку, его скорость равна v2​ метров в минуту (v2≤v1​).

Вася может мгновенно купить продукты, получить посылку или занести имеющийся у него груз домой.

Определите минимальное время, за которое Вася может сходить за продуктами и посылкой и вернуться домой.

## Формат ввода
В единственной строке ввода записаны шесть целых чисел a, b, cc, v0​, v1​, v2​ — длина дороги от дома до супермаркета, длина дороги от дома до пункта выдачи, длина дороги от супермаркета до пункта выдачи, скорость Васи без груза, скорость Васи с продуктами **либо** посылкой, скорость Васи с продуктами **и** посылкой

## Формат вывода
В единственной строке выведите одно вещественное число — минимальное количество минут, которое потребуется Васе, чтобы сходить за продуктами и посылкой и вернуться домой. Абсолютная или относительная погрешность ответа не должна превышает 10^-4

## Пример

Ввод                    Вывод
4 1 2 5 5 5            1.200000000000000


# Ответ

```cpp
#include <iostream>
#include <vector>
#include <algorithm>

using namespace std;

int main() {
    vector<double> array;
    double a, b, c, v0, v1, v2;

    cin >> a >> b >> c >> v0 >> v1 >> v2;

    array.push_back((b / v0) + (b / v1) + (a / v0) + (c / v1) + (b / v1));
    array.push_back((b / v0) + (b / v1) + (a / v0) + (a / v1));
    array.push_back((b / v0) + (b / v1) + (b / v0) + (c / v0) + (a / v1));
    array.push_back((b / v0) + (b / v1) + (b / v0) + (c / v0) + (c / v1) + (b / v1));
    array.push_back((b / v0) + (c / v1) + (a / v2));
    array.push_back((b / v0) + (c / v1) + (c / v2) + (b / v2));
    array.push_back((a / v0) + (c / v1) + (b / v2));
    array.push_back((a / v0) + (c / v1) + (c / v2) + (a / v2));
    array.push_back((a / v0) + (a / v1) + (a / v0) + (c / v0) + (b / v1));
    array.push_back((a / v0) + (a / v1) + (a / v0) + (c / v0) + (c / v1) + (a / v1));
    array.push_back((a / v0) + (a / v1) + (b / v0) + (a / v1) + (c / v1));
    array.push_back((a / v0) + (a / v1) + (b / v0) + (b / v1));
    array.push_back((a / v0) + (c / v0) + (c / v1) + (a / v2));
    array.push_back((b / v0) + (c / v0) + (c / v1) + (b / v2));


    cout << *std::min_element(array.begin(), array.end()) << endl;

    return 0;
}
```
