# C. Кибербезопастность

На работе у Васи требуют менять пароль каждую неделю, причём новый пароль не должен совпадать ни с одним из предыдущих. Любимый Васин пароль — это строка s, состоящая из строчных английских букв. Этот пароль он использует первую неделю. Придумывать и запоминать новые пароли Васе лень. Поэтому он решил менять местами пару букв в исходном пароле s и получать новый пароль. Определите, сколько недель Вася сможет генерировать новые пароли с учетом пароля s на первой неделе.

## Формат ввода
Вводится строка ss (1≤∣s∣≤10), состоящая из строчных английских букв — начальный пароль Васи.

## Формат вывода
Выведите одно число — количество недель, в течение которых Вася сможет использовать исходный и измененные пароли.

### Пример

Ввод                Вывод
abacaba                  15

# Ответ


```cpp
#include <iostream>
#include <string>
#include <vector>

using namespace std;

int main() {
    string s;
    cin >> s;
    long long n = s.length();
    vector<long long> freq(26, 0);

    for (char c : s) {
        freq[c - 'a']++;
    }

    long long total_swaps = n * (n - 1) / 2;
    long long same_swaps = 0;

    for (long long count : freq) {
        if (count > 1) {
            same_swaps += count * (count - 1) / 2;
        }
    }

    long long result = 1 + total_swaps - same_swaps;
    cout << result << endl;

    return 0;
}

```

